OpenNuvoton/M451BSP/SampleCode/Nu-LB-M451/PM25Sensor/main.c
/**************************************************************************//**
 * @file     main.c
 * @version  V1.00
 * $Revision: 5 $
 * $Date: 15/09/02 10:03a $
 * @brief    Display an string on TFT LCD panel via SPI interface.
 *
 * @note
 * Copyright (C) 2013~2015 Nuvoton Technology Corp. All rights reserved.
 *
 ******************************************************************************/
#include <stdio.h>
#include "M451Series.h"

#define SPI_LCD_PORT  SPI2

#define ILI9341_RESET   PB15
#define ILI9341_DC      PB11
#define ILI9341_LED     PB5
#define BUZZER(x)       PC14 = (!x)

extern uint8_t Font8x16[];
extern unsigned char acFont[];
    
#define White           0xFFFF
#define Black           0x0000
#define Blue            0x001F
#define Blue2           0x051F
#define Red             0xF800
#define Magenta         0xF81F
#define Green           0x07E0
#define Cyan            0x7FFF
#define Yellow          0xFFE0

uint8_t LCD_ReadReg(uint8_t u8Comm)
{
    SPI_ClearRxFIFO(SPI_LCD_PORT);

    ILI9341_DC = 0;

    SPI_WRITE_TX(SPI_LCD_PORT, u8Comm);
    SPI_WRITE_TX(SPI_LCD_PORT, 0x00);

    // wait tx finish
    while(SPI_IS_BUSY(SPI_LCD_PORT));

    SPI_READ_RX(SPI_LCD_PORT);

    return (SPI_READ_RX(SPI_LCD_PORT));
}

void LCD_WriteCommand(uint8_t u8Comm)
{
    ILI9341_DC = 0;

    SPI_WRITE_TX(SPI_LCD_PORT, u8Comm);

    // wait tx finish
    while(SPI_IS_BUSY(SPI_LCD_PORT));
}

void LCD_WriteData(uint8_t u8Data)
{
    ILI9341_DC = 1;

    SPI_WRITE_TX(SPI_LCD_PORT, u8Data);

    // wait tx finish
    while(SPI_IS_BUSY(SPI_LCD_PORT));
}


void ILI9341_LCD_SetAddress(uint32_t x1, uint32_t x2, uint32_t y1, uint32_t y2)
{
    if(x1 >= 240)
        x1 = 239;
    if(x2 >= 240)
        x2 = 239;
    if(y1 >= 320)
        y1 = 319;
    if(y2 >= 320)
        y2 = 319;

    LCD_WriteCommand(0x2a);
    LCD_WriteData(x1 >> 8);
    LCD_WriteData(x1);
    LCD_WriteData(x2 >> 8);
    LCD_WriteData(x2);

    LCD_WriteCommand(0x2b);
    LCD_WriteData(y1 >> 8);
    LCD_WriteData(y1);
    LCD_WriteData(y2 >> 8);
    LCD_WriteData(y2);
}

void ILI9341_LCD_PutChar8x16(uint16_t x, uint16_t y, uint8_t c, uint32_t fColor, uint32_t bColor)
{
    uint32_t i, j;
    for(i = 0; i < 16; i++)
    {
        uint8_t m = Font8x16[c * 16 + i];
        ILI9341_LCD_SetAddress(x + i, x + i, y, y + 7);
        LCD_WriteCommand(0x2c);

        for(j = 0; j < 8; j++)
        {
            if((m & 0x01) == 0x01)
            {
                LCD_WriteData(fColor >> 8);
                LCD_WriteData(fColor);
            }
            else
            {
                LCD_WriteData(bColor >> 8);
                LCD_WriteData(bColor);
            }
            m >>= 1;
        }
    }
}


void ILI9341_LCD_Fill(uint16_t x, uint16_t y, uint16_t x1, uint16_t y1, uint32_t bColor)
{
    uint32_t i, j;
    
    ILI9341_LCD_SetAddress(x, x1-1, y, y1-1);
    
    //for(i=0;i<x1-x;i++)
    {
        LCD_WriteCommand(0x2c);

        for(j=0;j<(x1-x)*(y1-y);j++)
        {
            LCD_WriteData(bColor >> 8);
            LCD_WriteData(bColor);
        }
    }
}

void ILI9341_LCD_acFont(uint16_t x, uint16_t y, int32_t idx, int32_t scale, uint32_t fColor, uint32_t bColor)
{
    int32_t i, j, k, l;
    uint8_t c;
    
    
    ILI9341_LCD_SetAddress(x, x+scale*24-1, y, y+scale*32-1);
    LCD_WriteCommand(0x2c);
    for(j=0;j<scale*32;j++)
    {
        for(i=0;i<3;i++)
        {
            c = acFont[idx*3*32+(j/scale)*3+i];
            for(k=7;k>=0;k--)
            {
                for(l=0;l<scale;l++)
                {
                    if(((c >> k)&1) == 1)
                    {
                        LCD_WriteData(fColor >> 8);
                        LCD_WriteData(fColor);
                    }
                    else
                    {
                        LCD_WriteData(bColor >> 8);
                        LCD_WriteData(bColor);
                    }
                }
            }
        }
    }
}



void ILI9341_LCD_PutChar16x32(uint16_t x, uint16_t y, uint8_t c, uint32_t fColor, uint32_t bColor)
{
    uint32_t i, j,k;
    int32_t n;
    
    n = 16;
    for(i = 0; i < 16*n; i++)
    {
        uint8_t m = Font8x16[c * 16 + i/n];
        ILI9341_LCD_SetAddress(x + i, x + i, y, y + (8*n-1));
        LCD_WriteCommand(0x2c);

        for(j = 0; j < 8; j++)
        {
            if((m & 0x01) == 0x01)
            {
                for(k=0;k<n;k++)
                {
                    LCD_WriteData(fColor >> 8);
                    LCD_WriteData(fColor);
                }
            }
            else
            {
                for(k=0;k<n;k++)
                {
                    LCD_WriteData(bColor >> 8);
                    LCD_WriteData(bColor);
                }
            }
            m >>= 1;
        }
    }
}


void ILI9341_LCD_PutString(uint16_t x, uint16_t y, uint8_t *s, uint32_t fColor, uint32_t bColor)
{
    uint8_t l = 0;
    while(*s)
    {
        if(*s < 0x80)
        {
            //ILI9341_LCD_PutChar8x16(x, 312 - y - l * 8, *s, fColor, bColor);
            ILI9341_LCD_PutChar16x32(x, 312-120 - y - l * 120, *s, fColor, bColor);
            
            s++;
            l++;
        }
    }
}



void ILI9341_LCD_PutString8x16(uint16_t x, uint16_t y, uint8_t *s, uint32_t fColor, uint32_t bColor)
{
    uint8_t l = 0;
    while(*s)
    {
        if(*s < 0x80)
        {
            ILI9341_LCD_PutChar8x16(x, 312 - y - l * 8, *s, fColor, bColor);
            //ILI9341_LCD_PutChar16x32(x, 312-120 - y - l * 120, *s, fColor, bColor);
            
            s++;
            l++;
        }
    }
}


void ILI9341_LCD_Init(void)
{
    /* Configure DC/RESET/LED pins */
    ILI9341_DC = 0;
    ILI9341_RESET = 0;
    ILI9341_LED = 0;

    GPIO_SetMode(PB, BIT5, GPIO_MODE_OUTPUT);
    GPIO_SetMode(PB, BIT11, GPIO_MODE_OUTPUT);
    GPIO_SetMode(PB, BIT15, GPIO_MODE_OUTPUT);

    /* Configure LCD */
    ILI9341_DC = 1;

    ILI9341_RESET = 0;
    TIMER_Delay(TIMER0, 20000);

    ILI9341_RESET = 1;
    TIMER_Delay(TIMER0, 40000);

    LCD_WriteCommand(0xCB);
    LCD_WriteData(0x39);
    LCD_WriteData(0x2C);
    LCD_WriteData(0x00);
    LCD_WriteData(0x34);
    LCD_WriteData(0x02);

    LCD_WriteCommand(0xCF);
    LCD_WriteData(0x00);
    LCD_WriteData(0xC1);
    LCD_WriteData(0x30);

