OpenNuvoton/M451BSP/SampleCode/Nu-LB-M451/PM25Sensor/main.c
    /*
            +----+
    ________|40us|______
            ^__Trigger to start EADC here

       +---------+
    ___|    320us|______
    

    */



    /*Set PWM Timer period*/
    PWM_SET_CNR(PWM1, 0, 10000 - 1);
    PWM_SET_CNR(PWM1, 1, 10000 - 1);

    /* Enable PWM_CH0 period point trigger EADC */
    PWM1->EADCTS0 |= (PWM_EADCTS0_TRGEN0_Msk | (PWM_TRIGGER_ADC_EVEN_COMPARE_DOWN_COUNT_POINT << PWM_EADCTS0_TRGSEL0_Pos)) ;

    /* Set waveform generation */
    PWM1->WGCTL0 = 0x50000;
    PWM1->WGCTL1 = 0xa0000;

    // Enable output of PWM1 channel 1
    //PWM1->POEN |= PWM_POEN_POEN1_Msk | PWM_POEN_POEN0_Msk;
    PWM1->POEN |= PWM_POEN_POEN1_Msk;

    // Enable PWM0 channel 0 period interrupt, use channel 0 to measure time.
    //PWM1->INTEN0 = (PWM1->INTEN0 & ~PWM_INTEN0_PIEN0_Msk) | PWM_INTEN0_PIEN0_Msk;
    //NVIC_EnableIRQ(PWM0P1_IRQn);

    // Start
    PWM1->CNTEN |= PWM_CNTEN_CNTEN0_Msk | PWM_CNTEN_CNTEN1_Msk;

}


#define ADC_RESULT()    ((EADC->DAT[0] & EADC_DAT_RESULT_Msk) >> EADC_DAT_RESULT_Pos)
#define ADC_RESULT1()    ((EADC->DAT[1] & EADC_DAT_RESULT_Msk) >> EADC_DAT_RESULT_Pos)

void EADC_Init(void)
{
    /* Enable EADC module clock */
    CLK->APBCLK0 |= CLK_APBCLK0_EADCCKEN_Msk;

    /* EADC clock source is 72MHz, set divider to 8, ADC clock is 72/8 MHz */
    CLK->CLKDIV0  = (CLK->CLKDIV0 & ~CLK_CLKDIV0_EADCDIV_Msk) | (((8) - 1) << CLK_CLKDIV0_EADCDIV_Pos);

    /* Configure the GPB0 - GPB3 ADC analog input pins.  */
    SYS->GPB_MFPL &= ~(SYS_GPB_MFPL_PB0MFP_Msk | SYS_GPB_MFPL_PB1MFP_Msk |
                       SYS_GPB_MFPL_PB2MFP_Msk | SYS_GPB_MFPL_PB3MFP_Msk);
    SYS->GPB_MFPL |= (SYS_GPB_MFPL_PB0MFP_EADC_CH0 | SYS_GPB_MFPL_PB1MFP_EADC_CH1 |
                      SYS_GPB_MFPL_PB2MFP_EADC_CH2 | SYS_GPB_MFPL_PB3MFP_EADC_CH3);

    /* Disable the GPB0 - GPB3 digital input path to avoid the leakage current. */
    GPIO_DISABLE_DIGITAL_PATH(PB, 0xF);

    /* Set the ADC internal sampling time, input mode as single-end and enable the A/D converter */
    EADC->CTL = (EADC_CTL_SMPTSEL5 | EADC_CTL_DIFFEN_SINGLE_END | EADC_CTL_ADCEN_Msk);
    /* Configure the sample module 0 for analog input channel 3 and software trigger source.*/
    EADC->SCTL[0] = EADC_PWM1TG0_TRIGGER | EADC_SCTL_CHSEL(3);
    EADC->SCTL[1] = EADC_SOFTWARE_TRIGGER | EADC_SCTL_CHSEL(0);
    //EADC->SCTL[0] = EADC_SOFTWARE_TRIGGER | EADC_SCTL_CHSEL(3);
    
    
    /* Clear the A/D ADINT0 interrupt flag for safe */
    EADC->STATUS2 = EADC_STATUS2_ADIF0_Msk | EADC_STATUS2_ADIF1_Msk;

    /* Enable the sample module 0 interrupt.  */
    //EADC->CTL |= EADC_CTL_ADCIEN0_Msk | EADC_CTL_ADCIEN1_Msk;  //Enable sample module A/D ADINT0 Interrupt.
    //EADC->INTSRC[0] = 0x3;              //Enable sample module 0/1 interrupt.
//    NVIC_EnableIRQ(ADC00_IRQn);

    /* Reset the ADC interrupt indicator and trigger sample module 1 to start A/D conversion */
    EADC->SWTRG |= (0x2 << EADC_SWTRG_SWTRG_Pos);

}



#define KEY_EVENT ((PD11==0)||(PD2==0)||(PD3==0)||(PC0==0)||(PA8==0)||(PF2==0))

void GPA_IRQHandler(void)
{
    PA->INTSRC = PA->INTSRC;
}
void GPB_IRQHandler(void)
{
    PB->INTSRC = PB->INTSRC;
}
void GPC_IRQHandler(void)
{
    PC->INTSRC = PC->INTSRC;
}
void GPD_IRQHandler(void)
{
    PD->INTSRC = PD->INTSRC;
}
void GPE_IRQHandler(void)
{
    PE->INTSRC = PE->INTSRC;
}
void GPF_IRQHandler(void)
{
    PF->INTSRC = PF->INTSRC;
}

void ShowNum(uint32_t n)
{
    
    uint32_t color;
    
    color = Cyan;
    
    if(n >=100000)
        n = 99999;
    ILI9341_LCD_acFont(0, 0, n/10000, 1, color, Black);

    ILI9341_LCD_acFont(24, 0, 11, 1,color, Black);

    n = n % 10000;
    ILI9341_LCD_acFont(48, 0, n/1000, 1,color, Black);
    n = n % 1000;
    ILI9341_LCD_acFont(72, 0, n/100, 1,color, Black);
    n = n % 100;
    ILI9341_LCD_acFont(96, 0, n/10, 1,color, Black);
    n = n % 10;
    ILI9341_LCD_acFont(120, 0, n, 1,color, Black);
    
    ILI9341_LCD_acFont(144, 0, 12, 1,color, Black);
    ILI9341_LCD_acFont(168, 0, 13, 1,color, Black);
    
}



void ShowNum2(uint32_t n)
{
    
    uint32_t color;
    
    color = Red;
    
    if(n >=100000)
        n = 99999;
    ILI9341_LCD_acFont(0, 48, n/10000, 1, color, Black);

    ILI9341_LCD_acFont(24, 48, 11, 1,color, Black);

    n = n % 10000;
    ILI9341_LCD_acFont(48, 48, n/1000, 1,color, Black);
    n = n % 1000;
    ILI9341_LCD_acFont(72, 48, n/100, 1,color, Black);
    n = n % 100;
    ILI9341_LCD_acFont(96, 48, n/10, 1,color, Black);
    n = n % 10;
    ILI9341_LCD_acFont(120, 48, n, 1,color, Black);
    
    ILI9341_LCD_acFont(144, 48, 12, 1,color, Black);
    ILI9341_LCD_acFont(168, 48, 13, 1,color, Black);
    
}


void ShowPm25(float f)
{
    int32_t n;
    uint32_t color;
    
    color = Cyan;
    if(f < 0)
        f = 0;
    
    n = (int32_t)(f*1000);
    
    if(n >=10000)
        n = 9999;
    ILI9341_LCD_acFont(0, 0, n/1000, 1,color, Black);
    n = n % 1000;
    ILI9341_LCD_acFont(24, 0, n/100, 1,color, Black);
    n = n % 100;
    ILI9341_LCD_acFont(48, 0, n/10, 1,color, Black);
    n = n % 10;
    ILI9341_LCD_acFont(72, 0, n, 1,color, Black);
    
    ILI9341_LCD_acFont(96, 0, 12, 1,color, Black);
    ILI9341_LCD_acFont(120, 0, 13, 1,color, Black);
    
}


void ShowTemp(float ftemp)
{
    int32_t n;
    uint32_t color;
    
    color = Green;

    n = (int)(ftemp * 10 + 0.5);
    
    if(n >=1000)
        n = 999;
    ILI9341_LCD_acFont(0, 48, n/100, 1, color, Black);
    n = n % 100;
    ILI9341_LCD_acFont(24, 48, n/10, 1,color, Black);

    ILI9341_LCD_acFont(48, 48, 11, 1,color, Black);

    n = n % 10;
    ILI9341_LCD_acFont(72, 48, n, 1,color, Black);
    
    ILI9341_LCD_acFont(96, 48, 14, 1,color, Black);
}




void ShowFloat(float f)
{
    
    uint32_t color;
    
    color = Cyan;
    
    if(f >=10)
        f = 9.99;
    ILI9341_LCD_acFont(0, 0, (int32_t)f, 1, color, Black);
    f = (f - (int)f) * 10;
    ILI9341_LCD_acFont(24, 0, (int32_t)f, 1,color, Black);
    f = (f - (int)f) * 10;
    ILI9341_LCD_acFont(48, 0, (int32_t)f, 1,color, Black);
    f = (f - (int)f) * 10;
    ILI9341_LCD_acFont(72, 0, (int32_t)f, 1,color, Black);
}



#define FILTER_N        128
float g_aVolt[FILTER_N] = {0};
int32_t g_Idx = 0;


int main(void)
{
    char sbuf[16] = {0};
    int32_t i;
    int32_t hr, min, sec;
    int32_t hr1, min1, sec1;
    float fvolt, fpm25, fvo, fsum,ftemp;
    float fmax;
    uint32_t u32Reg;
    uint32_t u32Temperature, u32pm25;

