OpenNuvoton/M451BSP/SampleCode/Nu-LB-M451/PM25Sensor/main.c
    /*
        This is a sample code to down count 1 hr.
        Current count will be shown on TFT LCD.
        Press any key button will reset the counter.
        If down count to zero, it will enable buzzer to generate alarm.
    */
    
    
    /* Init System, IP clock and multi-function I/O */
    SYS_Init();
    /* Init UART to 115200-8n1 for print message */
    UART_Open(UART0, 115200);

    /* Configure SPI3 as a master, MSB first, 8-bit transaction, SPI Mode-0 timing, clock is 4MHz */
    SPI_Open(SPI_LCD_PORT, SPI_MASTER, SPI_MODE_0, 8, 24000000);

    /* Configure SPI1 as a low level active device. */
    SPI_EnableAutoSS(SPI_LCD_PORT, SPI_SS, SPI_SS_ACTIVE_LOW);

    /* Start SPI */
    SPI_ENABLE(SPI_LCD_PORT);

    /* Init LCD */
    ILI9341_LCD_Init();

    /* Brightness */
    SysTick_Config(SystemCoreClock / 100000);

    PC->MODE = 1 << 14*2;
    BUZZER(0);

    //PWM_Init();
    /* set PWMB channel 0 output configuration */
    //PWM_ConfigOutputChannel(PWM1, 5, 25000, 50);
    // Start PWM COUNT
    //PWM_Start(PWM1, 1 << 5);
    /* Diable PWM Output path for PWMB channel 0 */
    //PWM_EnableOutput(PWM1, 1 << 5);


    // Set PD2, PD3 as wakeup source
    

    /* Show the String on the screen */
    PB->MODE |= (3 << 6*2);
    PB6 = 1; // SD_PWR

    // Inital wakeup
    PD->INTEN = (1 << 2) | (1 << 3) | (1 << 11) | (1 << 18) | (1 << 19) | (1 << 17);
    PC->INTEN = (1 << 0);
    PA->INTEN = (1 << 8);
    PF->INTEN = (1 << 2);
    
    NVIC_EnableIRQ(GPD_IRQn);
    NVIC_EnableIRQ(GPA_IRQn);
    NVIC_EnableIRQ(GPC_IRQn);
    NVIC_EnableIRQ(GPF_IRQn);

#if 0
    g_u32Ticks = 0;
    while(g_u32Ticks < 300000);
    ILI9341_LED = 0;
    CLK_PowerDown();
    ILI9341_LED = 1;
    while(1);
#endif

    ILI9341_LCD_Fill(0,0, 240, 320, Black);

//    ILI9341_LCD_acFont(0*24, 0, 1, White, Black);
//    ILI9341_LCD_acFont(1*24, 0, 10, White, Black);
//    ILI9341_LCD_acFont(2*24, 0, 7, White, Black);
    
    PWM_Init();
    EADC_Init();
    
    PF->MODE = 0x1;
    
    fmax = -1;
    fvo = 999;
    i = 0;
    while(1)
    {
        /* Waiting for EADC convert */
        PF0 = 0;
        //while((EADC->STATUS2 & EADC_STATUS2_ADIF0_Msk) == 0);
        do{
            u32Reg = EADC->DAT[0];
        }while((u32Reg&EADC_DAT_VALID_Msk) == 0);
        u32pm25 = u32Reg & EADC_DAT_RESULT_Msk;
        
        PF0 = 1;
        /* Clear flag */
        //EADC->STATUS2 = EADC_STATUS2_ADIF0_Msk;
        
        if(g_Idx == 0)
        {
            ShowPm25(fpm25);
            ShowTemp(ftemp);
        }
        
        /* Re-start EADC Sample Module 1 */
        u32Reg = EADC->DAT[1];
        if((u32Reg&EADC_DAT_VALID_Msk))
        {
            u32Temperature = u32Temperature * 28800 + (u32Reg & EADC_DAT_RESULT_Msk)*(32767-28800) >> 15;
            ftemp = 21.0 - ((int)u32Temperature-2070)*31.0/760.0;
            EADC->SWTRG |= (0x2 << EADC_SWTRG_SWTRG_Pos);
        }
        
        fvolt = fvolt *0.98 + (5.0 * u32pm25 / 4096.0) * 0.02;
        if(fvolt < fvo)
        {
            fvo = fvolt;
            if(fvo < 0.03)
                fvo = 0.03;
        }
        
        fpm25 = 0.17 * (fvolt - fvo);
        if(fmax < fpm25)
            fmax = fpm25;
        printf("offset=%f, volt=%f, pm2.5=%f, max=%f, t=%f, \r",fvo, fvolt, fpm25, fmax, ftemp);
        
    }
    
    
    hr = 0;
    min = 0;
    sec = 5;
    hr1 = -1;
    min1 = -1;
    sec1 = -1;
    i = 0;
    while(1)
    {
        if(KEY_EVENT)
        {
            hr = 1;
            min = 0;
            sec = 0;
            
            g_u32Ticks = 100000;
        }

        if(g_u32Ticks >= 100000)
        {
            g_u32Ticks = 0;
            
            //sprintf(sbuf, "%02d", sec);
            //ILI9341_LCD_PutString(0, 0, sbuf, Red, Black);
            //sprintf(sbuf, "%02d:%02d", hr, min);
            //ILI9341_LCD_PutString8x16(0, 0, sbuf, White, Black);
            if(hr1 != hr)
            {
                ILI9341_LCD_acFont(0, 0, hr/10, 1, White, Black);
                ILI9341_LCD_acFont(24, 0, hr%10, 1,White, Black);
                hr1 = hr;
            }
            
            ILI9341_LCD_acFont(48, 0, 10, 1,White, Black);
            
            if(min1 != min)
            {
                ILI9341_LCD_acFont(72, 0, min/10, 1,White, Black);
                ILI9341_LCD_acFont(96, 0, min%10, 1,White, Black);
                min1 = min;
            }
            ILI9341_LCD_acFont(120, 0, 10, 1,White, Black);
            
            if(sec1 != sec)
            {
                ILI9341_LCD_acFont(144, 0, sec/10, 1,White, Black);
                ILI9341_LCD_acFont(168, 0, sec%10, 1,White, Black);
                
                ILI9341_LCD_acFont(0, 96, sec/10, 5,Red, Black);
                ILI9341_LCD_acFont(120, 96, sec%10, 5,Red, Black);
                
                
                sec1 = sec;
            }
            
            sec--;
            if(sec < 0)
            {
                min--;
                if(min < 0)
                {
                    hr--;
                    if(hr < 0)
                    {
                        i = 0;
                        while(1)
                        {
                            //PWM_EnableOutput(PWM1, 1 << 5);
                            BUZZER(1);
                            g_u32Ticks = 0;
                            while(g_u32Ticks < 100* 200)if(KEY_EVENT) break;
                            //PWM_DisableOutput(PWM1, 1 << 5);
                            BUZZER(0);
                            g_u32Ticks = 0;
                            while(g_u32Ticks < 100* 400)if(KEY_EVENT) break;
                            if(KEY_EVENT) break;
                            
                            if(i++> 360)
                            {   
                                /* System Off */
                                ILI9341_LED = 0;
                                CLK_PowerDown();
                                ILI9341_LED = 1;
                            }
                            
                        }
                        
                        hr = 0;
                        min = 59;
                        sec = 59;
                    }
                    else
                    {
                       sec+=60;
                       min+=60;
                    }
                }
                else
                    sec+=60;
            }
        }
    }
    while(1);
}
